resources/testData.json

{
    "payments": {
        "insertTestPayment": {
            "title": "test payment",
            "description": "test description",
            "amount": "20",
            "initialPaymentAmount": "23",
            "currency": "PMA",
            "startTimestamp": "1234566899",
            "endTimestamp": "9876543211",
            "numberOfPayments": 5,
            "type": 1,
            "frequency": 3,
            "merchantAddress": "string",
            "networkID": 3
        },
        "updateTestPayment": {
            "id": "",
            "title": "changes title",
            "description": "another description",
            "promo": "testing",
            "status": 2,
            "customerAddress": "0xuiuin2n",
            "amount": "20",
            "initialPaymentAmount": "23",
            "currency": "CVC",
            "startTimestamp": "987654321",
            "endTimestamp": "123456789",
            "numberOfPayments": 5,
            "nextPaymentDate": "123456789",
            "lastPaymentDate": "123456789",
            "type": 2,
            "frequency": 3,
            "registerTxHash": "string",
            "registerTxStatus": 1,
            "executeTxHash": "string",
            "executeTxStatus": 1,
            "cancelTxHash": "string",
            "cancelTxStatus": 1,
            "initialPaymentTxHash": "string",
            "initialPaymentTxStatus": 1,
            "merchantAddress": "string",
            "pullPaymentAddress": "string",
            "userId": "string",
            "networkID": 3
        }
    }
}